
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр БалансАбонементов
	Движения.БалансАбонементов.Записывать = Истина;
	Движение = Движения.БалансАбонементов.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Абонемент = Абонемент;
	Движение.Остаток = Продолжительность;

	// регистр РасписаниеЗанятий
	Движения.РасписаниеЗанятий.Записывать = Истина;
	Движение = Движения.РасписаниеЗанятий.Добавить();
	Движение.Филиал = Филиал;
	Движение.Аудитория = Аудитория;
	Движение.Сотрудник = Сотрудник;
	Движение.ВремяНачала = ВремяНачала;
	Движение.ВремяОкончания = ВремяОкончания;

	КонецПроцедуры
