
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.БалансАбонементов.Записывать = Истина;
	Движение = Движения.БалансАбонементов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Абонемент = Ссылка;
	Движение.Остаток = КоличествоЗанятий;
	
	
	Движения.РасчетыСКлиентами.Записывать = Истина;
	Движение = Движения.РасчетыСКлиентами.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Сумма = Стоимость;
	
КонецПроцедуры
